{
  "base_char_vocab": [
    "<blank>",
    "<unk>",
    "a",
    "b",
    "c",
    "d",
    "e",
    "g",
    "h",
    "i",
    "k",
    "l",
    "m",
    "n",
    "o",
    "p",
    "q",
    "r",
    "s",
    "t",
    "u",
    "v",
    "x",
    "y",
    "A",
    "B",
    "C",
    "D",
    "E",
    "G",
    "H",
    "I",
    "K",
    "L",
    "M",
    "N",
    "O",
    "P",
    "Q",
    "R",
    "S",
    "T",
    "U",
    "V",
    "X",
    "Y",
    "f",
    "F",
    "j",
    "J",
    "w",
    "W",
    "z",
    "Z",
    "0",
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9",
    " ",
    ",",
    ".",
    "?",
    "!",
    ":",
    ";",
    "-",
    "_",
    "(",
    ")",
    "[",
    "]",
    "{",
    "}",
    "'",
    "\"",
    "/",
    "\\",
    "@",
    "#",
    "$",
    "%",
    "^",
    "&",
    "*",
    "+",
    "=",
    "<",
    ">",
    "|"
  ],
  "base_char_vocab_size": 95,
  "blank_idx": 0,
  "classifier_dropout": 0.1,
  "combined_char_vocab": [
    "<blank>",
    " ",
    "!",
    "\"",
    "#",
    "$",
    "%",
    "&",
    "'",
    "(",
    ")",
    "*",
    "+",
    ",",
    "-",
    ".",
    "/",
    "0",
    "1",
    "2",
    "3",
    "4",
    "5",
    "6",
    "7",
    "8",
    "9",
    ":",
    ";",
    "<",
    "=",
    ">",
    "?",
    "@",
    "A",
    "B",
    "C",
    "D",
    "E",
    "F",
    "G",
    "H",
    "I",
    "J",
    "K",
    "L",
    "M",
    "N",
    "O",
    "P",
    "Q",
    "R",
    "S",
    "T",
    "U",
    "V",
    "W",
    "X",
    "Y",
    "Z",
    "[",
    "\\",
    "]",
    "^",
    "_",
    "a",
    "b",
    "c",
    "d",
    "e",
    "f",
    "g",
    "h",
    "i",
    "j",
    "k",
    "l",
    "m",
    "n",
    "o",
    "p",
    "q",
    "r",
    "s",
    "t",
    "u",
    "v",
    "w",
    "x",
    "y",
    "z",
    "{",
    "|",
    "}",
    "\u00c0",
    "\u00c1",
    "\u00c2",
    "\u00c3",
    "\u00c8",
    "\u00c9",
    "\u00ca",
    "\u00cc",
    "\u00cd",
    "\u00d2",
    "\u00d3",
    "\u00d4",
    "\u00d5",
    "\u00d9",
    "\u00da",
    "\u00dd",
    "\u00e0",
    "\u00e1",
    "\u00e2",
    "\u00e3",
    "\u00e8",
    "\u00e9",
    "\u00ea",
    "\u00ec",
    "\u00ed",
    "\u00f2",
    "\u00f3",
    "\u00f4",
    "\u00f5",
    "\u00f9",
    "\u00fa",
    "\u00fd",
    "\u0102",
    "\u0103",
    "\u0110",
    "\u0111",
    "\u0128",
    "\u0129",
    "\u0168",
    "\u0169",
    "\u01a0",
    "\u01a1",
    "\u01af",
    "\u01b0",
    "\u1ea0",
    "\u1ea1",
    "\u1ea2",
    "\u1ea3",
    "\u1ea4",
    "\u1ea5",
    "\u1ea6",
    "\u1ea7",
    "\u1ea8",
    "\u1ea9",
    "\u1eaa",
    "\u1eab",
    "\u1eac",
    "\u1ead",
    "\u1eae",
    "\u1eaf",
    "\u1eb0",
    "\u1eb1",
    "\u1eb2",
    "\u1eb3",
    "\u1eb4",
    "\u1eb5",
    "\u1eb6",
    "\u1eb7",
    "\u1eb8",
    "\u1eb9",
    "\u1eba",
    "\u1ebb",
    "\u1ebc",
    "\u1ebd",
    "\u1ebe",
    "\u1ebf",
    "\u1ec0",
    "\u1ec1",
    "\u1ec2",
    "\u1ec3",
    "\u1ec4",
    "\u1ec5",
    "\u1ec6",
    "\u1ec7",
    "\u1ec8",
    "\u1ec9",
    "\u1eca",
    "\u1ecb",
    "\u1ecc",
    "\u1ecd",
    "\u1ece",
    "\u1ecf",
    "\u1ed0",
    "\u1ed1",
    "\u1ed2",
    "\u1ed3",
    "\u1ed4",
    "\u1ed5",
    "\u1ed6",
    "\u1ed7",
    "\u1ed8",
    "\u1ed9",
    "\u1eda",
    "\u1edb",
    "\u1edc",
    "\u1edd",
    "\u1ede",
    "\u1edf",
    "\u1ee0",
    "\u1ee1",
    "\u1ee2",
    "\u1ee3",
    "\u1ee4",
    "\u1ee5",
    "\u1ee6",
    "\u1ee7",
    "\u1ee8",
    "\u1ee9",
    "\u1eea",
    "\u1eeb",
    "\u1eec",
    "\u1eed",
    "\u1eee",
    "\u1eef",
    "\u1ef0",
    "\u1ef1",
    "\u1ef2",
    "\u1ef3",
    "\u1ef4",
    "\u1ef5",
    "\u1ef6",
    "\u1ef7",
    "\u1ef8",
    "\u1ef9",
    "[UNK]"
  ],
  "combined_char_vocab_size": 229,
  "conditioning_method": "concat_proj",
  "diacritic_vocab": [
    "no_diacritic",
    "acute",
    "grave",
    "hook",
    "tilde",
    "dot",
    "circumflex",
    "breve",
    "horn",
    "stroke",
    "circumflex_grave",
    "circumflex_acute",
    "circumflex_tilde",
    "circumflex_hook",
    "circumflex_dot",
    "breve_grave",
    "breve_acute",
    "breve_tilde",
    "breve_hook",
    "breve_dot",
    "horn_grave",
    "horn_acute",
    "horn_tilde",
    "horn_hook",
    "horn_dot"
  ],
  "diacritic_vocab_size": 25,
  "feature_fusion_method": "concat_proj",
  "hierarchical_mode": "sequential",
  "max_seq_len_for_pos_enc": 1024,
  "model_description": "Sequential-HCTC-DynFusion+FeatEnh+CDC",
  "model_type": "hierarchical_ctc_transformer",
  "multitask_loss_weights": [
    1.0,
    0.1,
    0.1
  ],
  "num_few_shot_prototypes": 5,
  "num_shared_layers": 1,
  "num_transformer_encoder_layers": 6,
  "positional_encoding_type": "sinusoidal_1d",
  "shared_hidden_size": 768,
  "transformer_d_model": 768,
  "transformer_dim_feedforward": 2048,
  "transformer_dropout": 0.1,
  "transformer_nhead": 12,
  "transformers_version": "4.56.2",
  "use_character_diacritic_compatibility": true,
  "use_dynamic_fusion": true,
  "use_feature_enhancer": true,
  "use_few_shot_diacritic_adapter": false,
  "use_visual_diacritic_attention": false,
  "vision_encoder_config": {
    "_name_or_path": "",
    "add_cross_attention": false,
    "architectures": null,
    "attention_probs_dropout_prob": 0.0,
    "bad_words_ids": null,
    "begin_suppress_tokens": null,
    "bos_token_id": null,
    "chunk_size_feed_forward": 0,
    "cross_attention_hidden_size": null,
    "decoder_start_token_id": null,
    "diversity_penalty": 0.0,
    "do_sample": false,
    "dtype": "float32",
    "early_stopping": false,
    "encoder_no_repeat_ngram_size": 0,
    "encoder_stride": 16,
    "eos_token_id": null,
    "exponential_decay_length_penalty": null,
    "finetuning_task": null,
    "forced_bos_token_id": null,
    "forced_eos_token_id": null,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 768,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "image_size": 384,
    "initializer_range": 0.02,
    "intermediate_size": 3072,
    "is_decoder": false,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_norm_eps": 1e-12,
    "length_penalty": 1.0,
    "max_length": 20,
    "min_length": 0,
    "model_type": "vit",
    "no_repeat_ngram_size": 0,
    "num_attention_heads": 12,
    "num_beam_groups": 1,
    "num_beams": 1,
    "num_channels": 3,
    "num_hidden_layers": 12,
    "num_return_sequences": 1,
    "output_attentions": false,
    "output_hidden_states": false,
    "output_scores": false,
    "pad_token_id": null,
    "patch_size": 16,
    "pooler_act": "tanh",
    "pooler_output_size": 768,
    "prefix": null,
    "problem_type": null,
    "pruned_heads": {},
    "qkv_bias": false,
    "remove_invalid_values": false,
    "repetition_penalty": 1.0,
    "return_dict": true,
    "return_dict_in_generate": false,
    "sep_token_id": null,
    "suppress_tokens": null,
    "task_specific_params": null,
    "temperature": 1.0,
    "tf_legacy_loss": false,
    "tie_encoder_decoder": false,
    "tie_word_embeddings": true,
    "tokenizer_class": null,
    "top_k": 50,
    "top_p": 1.0,
    "torchscript": false,
    "transformers_version": "4.56.2",
    "typical_p": 1.0,
    "use_bfloat16": false
  },
  "vision_encoder_layer_indices": [
    -7,
    -4,
    -1
  ],
  "vision_encoder_name": "microsoft/trocr-base-handwritten"
}
